.config/emacs/README.org
#+title: Emacs configuration with Org Mode
#+author: Andrey Listopadov
#+email: andreyorst@gmail.com
#+setupfile: ./.org-defaults.org
#+startup: noinlineimages
#+property: header-args :results silent

* About this document
This is a GNU Emacs configuration file, written as an Org document.
It is meant to be placed in the =user-emacs-directory=, and compiled with =org-babel-tangle=.
As a result =init.el= and =early-init.el= files are created, located in the same directory as this file, as well as some other files across the system.
You can review such files by searching for =:tangle= in this file.
Both =init.el= and =early-init.el= are default to the read only mode, thus only this file needs to be edited, and is automatically tangled on save.

* =early-init.el=
:properties:
:header-args+: :tangle "./early-init.el"
:end:
Emacs 27 introduced new initialization file called =earli-init.el=, which is executed before =init.el=.
It is meant to configure package initialization and early graphical interface tweaks, before actually drawing a window.

#+begin_src emacs-lisp
  ;;; early-init.el --- Early initialization -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  ;; Author: Andrey Listopadov
  ;; Keywords: literate programming, Emacs configuration
  ;; Homepage: https://gitlab.com/andreyorst/dotfiles/-/tree/master/.config/emacs

  ;;; Commentary:
  ;; Emacs config.
  ;; This file was automatically generated by `org-babel-tangle'.
  ;; Do not change this file.  Main config is located in README.org at `user-emacs-directory'

  ;;; Code:
#+end_src

** Emacs 28 Obsolete workaround
Emacs 28 made some changes to obsolete-related functions, making the third argument =when= mandatory.
This broke a lot of packages, so for now, a workaround is to define an =around= advice:

#+begin_src emacs-lisp
  (defun aorst/wrap-obsolete (orig-fn &rest args)
    "Append extra argument to ARGS before calling ORIG-FN function."
    (if (cddr args)
        (apply orig-fn args)
      (apply orig-fn `(,@args "0"))))

  (advice-add 'make-obsolete :around #'aorst/wrap-obsolete)
  (advice-add 'make-obsolete-variable :around #'aorst/wrap-obsolete)
  (advice-add 'define-obsolete-variable-alias :around #'aorst/wrap-obsolete)
  (advice-add 'define-obsolete-function-alias :around #'aorst/wrap-obsolete)
#+end_src

** Garbage Collection and Performance
One of the main reasons why Emacs startup time is big is that the garbage collection is invoked a lot, causing the increase of the startup time.
This can be migrated by setting high GC threshold and restoring it back in =after-init-hook=.

#+begin_src emacs-lisp
  (defvar aorst--gc-cons-threshold gc-cons-threshold)
  (defvar aorst--gc-cons-percentage gc-cons-percentage)
  (defvar aorst--file-name-handler-alist file-name-handler-alist)

  (setq-default gc-cons-threshold 402653184
                gc-cons-percentage 0.6
                file-name-handler-alist nil)

  (defun aorst/restore-defaults-after-init ()
    "Restore default values after initialization."
    (setq-default gc-cons-threshold aorst--gc-cons-threshold
                  gc-cons-percentage aorst--gc-cons-percentage
                  file-name-handler-alist aorst--file-name-handler-alist))

  (add-hook 'after-init-hook #'aorst/restore-defaults-after-init)

  (setq read-process-output-max (* 1024 1024 4) ; 4mb
        inhibit-compacting-font-caches t
        message-log-max 16384)
#+end_src

** Native Compiled Emacs Lisp
Emacs 28 can compile Emacs Lisp to native code.
These settings enable background asynchronous compilation, and dynamic reloading of compiled modules.

#+begin_src emacs-lisp
  (when (featurep 'native-compile)
    (setq native-comp-deferred-compilation t)
    (setq native-comp-async-report-warnings-errors nil))
#+end_src

** User Interface
This code sets default size of the frame and prevents the glimpse of unstyled Emacs by disabling some UI elements early.
Resizing frame is also expensive, and setting =x-gtk-resize-child-frames= variable to =resize-mode= is a workaround for the [[https://gitlab.gnome.org/GNOME/mutter/-/issues/840][issue]] with child frames not being resized correctly under Mutter.

#+begin_src emacs-lisp
  (setq-default initial-frame-alist '((width . 170)
                                      (height . 56)
                                      (tool-bar-lines . 0)
                                      (bottom-divider-width . 0)
                                      (right-divider-width . 1))
                default-frame-alist initial-frame-alist
                frame-inhibit-implied-resize t
                x-gtk-resize-child-frames 'resize-mode
                fringe-indicator-alist (assq-delete-all 'truncation fringe-indicator-alist))
#+end_src

** =straight.el=
Straight is an alternative way to manage package installations.
It can install packages from Git repositories listed on ELPA, MELPA, and directly from Git URLs.

#+begin_src emacs-lisp
  (defvar straight-process-buffer)
  (setq-default straight-process-buffer " *straight-process*")

  (defvar straight-repository-branch)
  (setq straight-repository-branch "develop")

  (defvar straight-build-dir)
  (setq straight-build-dir (format "build-%s" emacs-version))

  (let ((bootstrap-file
         (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory)))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
          (url-retrieve-synchronously
           "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
           'silent 'inhibit-cookies)
        (goto-char (point-max))
        (eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (defvar straight-check-for-modifications)
  (setq-default straight-check-for-modifications '(check-on-save))
#+end_src

** early =package.el= settings
=package.el= initialization is expensive, thus should be disabled before loading main init file:

#+begin_src emacs-lisp
  (setq package-enable-at-startup nil)
#+end_src

** =(provide 'early-init)=
This concludes the =early-init.el= file.

#+begin_src emacs-lisp
  (provide 'early-init)
  ;;; early-init.el ends here
#+end_src

* =init.el=
:properties:
:header-args+: :tangle "./init.el"
:end:
Main GNU Emacs init file.

#+begin_src emacs-lisp
  ;;; init.el --- Emacs main configuration file -*- lexical-binding: t; buffer-read-only: t; no-byte-compile: t -*-

  ;; Author: Andrey Listopadov
  ;; Keywords: literate programming, Emacs configuration
  ;; Homepage: https://gitlab.com/andreyorst/dotfiles/-/tree/master/.config/emacs

  ;;; Commentary:
  ;; Emacs config.
  ;; This file was automatically generated by `org-babel-tangle'.
  ;; Do not change this file.  Main config is located in README.org at `user-emacs-directory'

  ;;; Code:
#+end_src

** Loading =early-init.el= in Emacs 26 and earlier
When using pre Emacs 27 =eraly-init.el= must be loaded manually before anything from =init.el=.

#+begin_src emacs-lisp
  (unless (featurep 'early-init)
    (load (expand-file-name "early-init" user-emacs-directory)))
#+end_src

** Defaults
Section with configurations that need to be done early enough or hard to categorize.

*** =use-package=
A macro for managing installed packages, and encapsulating their configurations.

#+begin_src emacs-lisp
  (straight-use-package 'use-package)
  (defvar straight-use-package-by-default)
  (setq straight-use-package-by-default t)
  (require 'use-package)
#+end_src

*** Custom File and Disabled Commands
Emacs customization system writes to =init.el= by default which is not great when using tangle approach.
To preserve custom modifications it is moved to separate file.

#+begin_src emacs-lisp
  (use-package cus-edit
    :straight nil
    :custom (custom-file (expand-file-name "custom.el" user-emacs-directory))
    :init (load custom-file :noerror))
#+end_src

Same thing with disabled commands.

#+begin_src emacs-lisp
  (defvar aorst--disabled-commands (expand-file-name "disabled.el" user-emacs-directory)
    "File to store disabled commands, that were enabled permamently.")

  (define-advice enable-command (:around (foo command) aorst:put-in-custom-file)
    (let ((user-init-file aorst--disabled-commands))
      (funcall foo command)))

  (load aorst--disabled-commands :noerror)
#+end_src

*** Personal custom group
Group for custom, which provides a way of persisting options without needing to use concrete values in this config directly.
Can be used for creating machine local configurations.

#+begin_src emacs-lisp
  (defgroup local-config nil
    "Customization group for local settings."
    :prefix "local-config-")
#+end_src

*** User Credentials
Some modes can use full name and e-mail address automatically.

#+begin_src emacs-lisp
  (use-package startup
    :straight nil
    :no-require t
    :custom
    (user-mail-address "andreyorst@gmail.com")
    (user-full-name "Andrey Listopadov"))
#+end_src

*** Bell
No bell.

#+begin_src emacs-lisp
  (setq ring-bell-function 'ignore)
#+end_src

*** Backups
Backup files and auto-save files are kept within =.cache= directory located at =user-emacs-direcotry=.

#+begin_src emacs-lisp
  (use-package files
    :straight nil
    :custom
    (backup-by-copying t)
    (create-lockfiles nil)
    (backup-directory-alist
     `(("." . ,(expand-file-name ".cache/backups" user-emacs-directory))))
    (auto-save-file-name-transforms
     `((".*" ,(expand-file-name ".cache/auto-save/" user-emacs-directory) t)))
    (auto-save-no-message t)
    (auto-save-interval 100)
    :config
    (let ((auto-save-dir (expand-file-name ".cache/auto-save/" user-emacs-directory)))
      (unless (file-exists-p auto-save-dir)
        (make-directory auto-save-dir t))))
#+end_src

*** Yes or No
Prompt for =y= or =n= instead of =yes= or =no=.

#+begin_src emacs-lisp
  (use-package subr
    :straight nil
    :no-require t
    :init
    (fset 'yes-or-no-p 'y-or-n-p))
#+end_src

